/****************************************************************************************
**  Filename :  het_led.h
**  Abstract :  LED模块化程序，支持设置LED常亮，常灭，闪烁周期设置，闪烁次数设置等功能。
**  By       :  何建国
**  Date     :  2018-11-21
**  Changelog:1.First Create
*****************************************************************************************/
#ifndef _TASK_H
#define _TASK_H
/*****************************************************************************************
									Includes
*****************************************************************************************/
#include "stdint.h"
#include "stdio.h"
/*****************************************************************************************
								Macro definitions
*****************************************************************************************/
#ifdef PR_308_L2
#define MAX_TASK_NUMBER         10      //最大任务数量
#endif

#ifdef PR_307_L3
#define MAX_TASK_NUMBER         11      //最大任务数量
#endif

#define TASK_STOP               0       //任务停止
#define TASK_RUN                1       //任务运行
/*****************************************************************************************
								Typedef definitions
*****************************************************************************************/
// 任务结构
typedef struct _TASK_COMPONENTS
{
    uint8_t Run; // 程序运行标记：0-不运行，1运行
    uint16_t Timer; // 计时器
    uint16_t ItvTime; // 任务运行间隔时间
    void (*TaskHook)(void); // 要运行的任务函数
    void (*TaskHook_Interrupt)(void); // 要运行的任务函数
}TASK_COMPONENTS; // 任务定义
/*****************************************************************************************
							Global variables and functions
*****************************************************************************************/

//----------------------------------------------------------------------------------------
extern void TaskDeInit(void);
extern void Task_Init(uint8_t Run, uint16_t Timer, uint16_t ItvTime, void (*TaskFun)(void), void (*TaskIntFun)(void));
extern void TaskProcess(void);
extern void HAL_SYSTICK_Callback(void);
#endif
/***********************************END OF FILE*******************************************/
