/****************************************************************************************
**  Filename :  het_delay.c
**  Abstract :  延时功能模块。
**  By       :  wangbin  <letlink@126.com>
**  Date     :  2018-01-01
**  Changelog:1.First Create
*****************************************************************************************/

/*****************************************************************************************
									Includes
*****************************************************************************************/
#include "delay.h"
/*****************************************************************************************
							  Variables definitions
*****************************************************************************************/

/*****************************************************************************************
							  Functions definitions
*****************************************************************************************/		

/*****************************************************************************************
* Function Name: delay_us
* Description  : 微秒延时函数
* Arguments    : nus:要延时的us数.	
* Return Value : NONE
******************************************************************************************/						   
void delay_us(uint32_t nus)
{		
	#if (USE_SYSTICK_DELAY==1)
	uint32_t ticks;
	uint32_t told,tnow,tcnt=0;
	uint32_t reload=SysTick->LOAD;				//LOAD的值	    	 
	ticks=nus*SYSTICK_CLK; 						//需要的节拍数 
	told=SysTick->VAL;        				//刚进入时的计数器值
	while(1)
	{
		tnow=SysTick->VAL;	
		if(tnow!=told)
		{	    
			if(tnow<told)tcnt+=told-tnow;	//这里注意一下SYSTICK是一个递减的计数器就可以了.
			else tcnt+=reload-tnow+told;	    
			told=tnow;
			if(tcnt>=ticks)break;			//时间超过/等于要延迟的时间,则退出.
		}  
	};
	#else
	volatile uint32_t i,j;
	for(i=0;i<nus;i++)
	{
		for(j=0;j<US_VAL;j++);
	}
	#endif
}  
 /*****************************************************************************************
* Function Name: delay_ms
* Description  : 毫秒延时函数
* Arguments    : /nms:要延时的ms数
* Return Value : NONE
******************************************************************************************/	
void delay_ms(uint32_t nms)
{	
	uint32_t i;
	for(i=0;i<nms;i++) delay_us(1000);
}
/***********************************END OF FILE*******************************************/
