/****************************************************************************************
**  Filename :  data_cmp.c
**  Abstract :  数据比较类算法处理。
**  By       :  何建国
**  Date     :  2018-12-10
**  Changelog:1.First Create
*****************************************************************************************/

/*****************************************************************************************
									Includes
*****************************************************************************************/
#include "data_cmp.h"
/*****************************************************************************************
							  Variables definitions
*****************************************************************************************/

/*****************************************************************************************
							  Functions definitions
*****************************************************************************************/
/*****************************************************************************************
* Function Name: ByteDataOrderCmp
* Description  : 字节数据顺序比较；
* Arguments    : 数据帧1起始地址，数据帧2起始地址，比较数据的个数
* Return Value : 比较结果 0 - 相等， 1 - 不相等
******************************************************************************************/
uint8_t ByteDataOrderCmp(const uint8_t *pData1, const uint8_t *pData2, uint16_t len)
{
    uint16_t i = 0;
    uint8_t ret_val = 0;
    
    for(i = 0; i < len; i++)
    {
        if(pData1[i] != pData2[i])
        {
            ret_val = 1;
            break;
        }
    }
    
    return ret_val;
}
/*****************************************************************************************
* Function Name: HalfWordMinValObtain
* Description  : 半字数据序列中取最小值；
* Arguments    : 长度、首地址
* Return Value : 最小值对应的索引
******************************************************************************************/
uint16_t HalfWordMinValObtain(const uint16_t len, const uint16_t p_data[])
{
    uint16_t i = 0;
    uint16_t min_val = p_data[0];
    uint16_t min_info = 0;
    
    for(i = 1; i < len; i++)
    {
        if(p_data[i] < min_val)
        {
            min_val = p_data[i];
            min_info = i;
        }
    }
    return min_info;
}
/*****************************************************************************************
* Function Name: HalfWordMaxValObtain
* Description  : 半字数据序列中取最大值；
* Arguments    : 长度、首地址
* Return Value : 最小值对应的索引
******************************************************************************************/
uint16_t HalfWordMaxValObtain(const uint16_t len, const uint16_t p_data[])
{
    uint16_t i = 0;
    uint16_t max_val = p_data[0];
    uint16_t max_info = 0;
    
    for(i = 1; i < len; i++)
    {
        if(p_data[i] > max_val)
        {
            max_val = p_data[i];
            max_info = i;
        }
    }
    return max_info;
}
/***********************************END OF FILE*******************************************/
