/****************************************************************************************
**  Filename :  data_acc.c
**  Abstract :  数据查找类算法处理。
**  By       :  何建国
**  Date     :  2018-12-10
**  Changelog:1.First Create
*****************************************************************************************/

/*****************************************************************************************
									Includes
*****************************************************************************************/
#include "data_find.h"
/*****************************************************************************************
							  Variables definitions
*****************************************************************************************/

/*****************************************************************************************
							  Functions definitions
*****************************************************************************************/

/*****************************************************************************************
* Function Name: HalfWordFind
* Description  : 半字查找程序，在一个存放半字类数组中根据数据查找对应的序号（数组是按照从小到大的顺序排列的，
且被查找的数据不一定被包含在数组中）.
* Arguments    : NONE
* Return Value : NONE
******************************************************************************************/
uint16_t HalfWordFind(uint16_t len, const uint16_t *buf, uint16_t match_data)
{
    uint16_t info = 0;
    uint16_t i = 0;
    for(i = 0; i < len; i++)
    {
        if(match_data < buf[i])
        {
            if(0 == i)
            {
                info = i;
            }
            else
            {
                info = i - 1;
            }
            break;
        }
    }
    if(i == len)
    {
        info = i - 1;
    }
    return info;
}
/*****************************************************************************************
* Function Name: HalfWordFindOnly
* Description  : 半字精确查找程序，在一个存放半字类数组中根据数据查找对应的序号（数组是无序的，
且被查找的数据一定要与数组中的一个相匹配）.
* Arguments    : NONE
* Return Value : NONE
******************************************************************************************/
uint16_t HalfWordFindOnly(uint16_t len, const uint16_t *buf, uint16_t match_data)
{
    uint16_t info = 0;
    uint16_t i = 0;
    for(i = 0; i < len; i++)
    {
        if(match_data == buf[i])
        {
            info = i;
            break;
        }
    }
    return info;
}
/***********************************END OF FILE*******************************************/
