/****************************************************************************************
**  Filename :  data_acc.c
**  Abstract :  数据累加类算法处理。
**  By       :  何建国
**  Date     :  2018-12-10
**  Changelog:1.First Create
*****************************************************************************************/

/*****************************************************************************************
									Includes
*****************************************************************************************/
#include "data_acc.h"
/*****************************************************************************************
							  Variables definitions
*****************************************************************************************/

/*****************************************************************************************
							  Functions definitions
*****************************************************************************************/

/*****************************************************************************************
* Function Name: ByteSum
* Description  : 计算以buf为起始地址的len个字节的累加教研和，结果存入字节变量sum中().
* Arguments    : NONE
* Return Value : NONE
******************************************************************************************/
uint8_t ByteSum(uint16_t len, const uint8_t buf[len])
{
    uint32_t sum = 0;
    uint16_t i = 0;
    for(i = 0; i < len; i++)
    {
        sum += buf[i];
    }
    return sum;
}
/*****************************************************************************************
* Function Name: HalfWordAccSum
* Description  : 半字数据累加和
* Arguments    : 数据序列长度、首地址
* Return Value : 累加和值
******************************************************************************************/
uint32_t HalfWordAccSum(uint16_t len, uint16_t buf[len])
{
    uint32_t sum = 0;
    uint16_t i = 0;
    for(i = 0; i < len; i++)
    {
        sum += buf[i];
    }
    return sum;
}
/*****************************************************************************************
* Function Name: WordSum
* Description  : 计算以buf为起始地址的len个字的累加和，结果存入字节变量sum中().
* Arguments    : NONE
* Return Value : NONE
******************************************************************************************/
uint32_t WordSum(uint16_t len, uint32_t *buf)
{
    uint32_t sum = 0;
    uint16_t i = 0;
    for(i = 0; i < len; i++)
    {
        sum += buf[i];
    }
    return sum;
}
/*****************************************************************************************
* Function Name: calculate_byte_xor_sum
* Description  : 计算以buf为起始地址的len个字节与异或因子异或后的累加和，结果存入字节变量sum中.
* Arguments    : 数据长度、数据指针和异或量
* Return Value : NONE
******************************************************************************************/
uint32_t calculate_byte_xor_sum(uint16_t len, uint8_t *buf, uint8_t xor_factor)
{
    uint32_t sum = 0;
    uint16_t i = 0;
    for(i = 0; i < len; i++)
    {
        sum = sum + (buf[i] ^ xor_factor);
    }
    return sum;
}
/***********************************END OF FILE*******************************************/
