/*********************************************************************************
  *Copyright(C), 2021, Aputure, All rights reserver.
  *FileName:    user_bluetooth_proto.h
  *Author:         
  *Version:     v3.9.2
  *Date:        2021/08/13
  *Description: APP与MCU通信的蓝牙数据包格式
                v1.0：2018/11/07,Steven
                v1.1：2019/01/11,Steven,对应v1.3版本蓝牙通信协议
                v1.2：2019/02/22,Steven,对应v1.4版本蓝牙通信协议，将通信包长度修改为10byte
                v1.3：2019/03/09,Steven,对应v1.5版本蓝牙通信协议，将GET_VER中Product由16bit改为32bit，
                      将其余版本说明改为6bit，添加BT_Product_TypeDef结构体对产品类型进行说明
                v1.4：2019/03/25,Steven,对应v1.6版本蓝牙通信协议，添加电池电量剩余使用时间,添加获取当前界面信息命令
                      将产品类型数据结构嵌入到BT_Version_Body_TypeDef中，添加Main_Interface协议
                v1.5：2019/04/30,Steven,对应v1.7版本蓝牙通信协议，在光模式协议包最后添加开关机状态
                v1.6: 2019/05/08,Steven,对应v1.8版本蓝牙通信协议，细分Get_Power中的Battery_Power，细分GEL_CMD中的Gel Type，
                      细分EFFECT_CMD中的Strobe/Explosion/Fault_Bulb/Pulsing/Welding这5个光效中的Gel Type
                v1.7: 2019年5月9日，Jagger,对应v1.9版本蓝牙协议，增加了整体照度设置协议Light_Bright；
                v1.8: 2019/08/03,Steven,对应v2.3版本蓝牙通信协议
                V3.0: 2019/11/20,Matthew,对应V3.0版本协议
                V3.4: 2020/01/16,Matthew,对应V3.4版本协议
                V3.5: 2020/02/29,Jagger,对应V3.5版本协议，增加一个APP控制类型，目前此类型值为0，对应控制蓝牙重置
                V3.6: 2020/03/04,Matthew,对应V3.6版本协议，新增CustomEfect_Preview命令0x1E，用与预览光效，包含两个帧的参数

#define     PACKED     __attribute__((packed))

#elif defined ( __CC_ARM )
#define PACKED __packed

#else
#error "We do not know how your compiler packs structures"
#endif

#define LITTLE_ENDIAN       (0)       /*小端模式*/
#define BIG_ENDIAN          (1)       /*大端模式*/


#ifndef BYTE_ORDER
#define BYTE_ORDER          LITTLE_ENDIAN
#endif

#define BT_PACKET_SIZE      (10)

#define DEFINE_STRUCT       PACKED struct
#define TYPEDEFINE_STRUCT   typedef PACKED struct
#define DEFINE_BODY(s)      s ## _Body_TypeDef

#define TYPEDEFINE_ENUM     typedef enum

#define DEFINE_EFFECT_ARG(s)    s ## _Arg_TypeDef

/*---命令类型---*/
typedef enum{     
    BT_CommandType_Version = 0,
    BT_CommandType_HSI,
    BT_CommandType_CCT,
    BT_CommandType_GEL,
    BT_CommandType_RGBWW,
    BT_CommandType_XY_Coordinate,
    BT_CommandType_LED_Frequency,
    BT_CommandType_Light_Effect,
    BT_CommandType_Dimming_Curve,
    BT_CommandType_Fan_Speed,
    BT_CommandType_Get_Power,
    BT_CommandType_Board_State,
    BT_CommandType_Sleep_Mode,
    BT_CommandType_Main_Interface,
    BT_CommandType_Light_Mode,
    BT_CommandType_Light_Bright,
    BT_CommandType_Bridge_Effects,  //0x10
    BT_CommandType_Bridge_Cmd,
    BT_CommandType_Bridge_BankStatus,
    BT_CommandType_PFX_Flash,
    BT_CommandType_PFX_Chase,
    BT_CommandType_PFX_Continue,
    BT_CommandType_Bridge_SleepMode,
    BT_CommandType_Bridge_LightBright,
    BT_CommandType_Bridge_FixtureSet,
    BT_CommandType_IOT_Cmd,
    BT_CommandType_CFX_Bank_RW,
    BT_CommandType_Factory_Reset,
    BT_CommandType_CFX_Ctrl,
    BT_CommandType_APP_Ctrl,
    BT_CommandType_CFX_Preview,
    BT_CommandType_MFX,
    BT_CommandType_CFX_Name,        //0x20
	BT_CommandType_Pixel_Fx,
	BT_CommandType_Light_Effect_II,
	BT_CommandType_Partition_Para,
    BT_CommandType_Partition_Fx,
    BT_CommandType_Version2,
    BT_CommandType_Partition_Cfg,    
	BT_CommandType_Emotion_Cfg = 0X2B,
    BT_CommandType_Emotion_Live = 0X2C,
	BT_CommandType_High_speed = 0x35,
	BT_CommandType_READ_SN = 0x3A,
    BT_CommandType_NULL = 0x7F,     //Max=0x7F
}BT_CommandType_TypeDef;

/*---光效类型---*/
typedef enum{     
     BT_EffectType_ClubLights = 0,
     BT_EffectType_Paparazzi,
     BT_EffectType_Lightning,
     BT_EffectType_TV,
     BT_EffectType_Candle,
     BT_EffectType_Fire,
     BT_EffectType_Strobe,
     BT_EffectType_Explosion,
     BT_EffectType_FaultBulb,
     BT_EffectType_Pulsing,
     BT_EffectType_Welding,
     BT_EffectType_CopCar,
     BT_EffectType_ColorChase,
     BT_EffectType_PartyLights,
     BT_EffectType_Fireworks,
     BT_EffectType_Effect_Off,
     BT_EffectType_I_Am_Here,
     BT_EffectType_NULL,
}BT_EffectType_TypeDef;

/*---光效子类型---*/
typedef enum{
     BT_EffectMode_CCT = 0,
     BT_EffectMode_HSI,
     BT_EffectMode_GEL,
     BT_EffectMode_XY,
	 BT_EffectMode_SOURCE,
     BT_EffectMode_NULL,
}BT_Effect_Mode_TypeDef;

typedef __packed struct{     
     uint8_t Command_Type       :7;       /*0-127*/ /*max: 127*/
     uint8_t Opera_Type         :1;       /*0-1*/ /*master: read:0  write:1; 
                                                    slave:  ack:0;   nack:1; */
}BT_Header_TypeDef; /*size: 1*/

/*----------Version：0x00----------*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t GATT_Ver           :1;     /*0:GATT协议1.x版本  1:GATT协议2.0及以上版本*/
    uint64_t Upgrade_Type       :1;     /*升级类型 0：OTA 1：GATT*/
    uint64_t Driver_SwVer       :6;     /*11:代表版本v1.1*/
    uint64_t Driver_HwVer       :6;     /*11:代表版本v1.1*/
    uint64_t Control_SwVer      :6;     /*11:代表版本v1.1*/
    uint64_t Control_HwVer      :6;     /*11:代表版本v1.1*/
    uint64_t CFX_Music_Support  :1;     /*支持CFX_Music*/
    uint64_t CFX_Touchbar_Support:1;    /*支持CFX_Touchbar*/
    uint64_t CFX_Picker_Support :1;     /*支持CFX_Picker*/
    uint64_t PFX_Support        :1;     /*支持PFX*/
    uint64_t MFX_Support        :1;     /*支持MFX*/
    uint64_t Product_Machine    :4;     /*0：无/SFL  1：变焦/VFL  2：变焦+航向+俯仰/TA*/
    uint64_t Product_CCTRange   :7;     /*色温上限*/
    uint64_t Product_CCTRange_L :7;     /*色温下限*/
    uint64_t Product_LedType    :5;     /*0：D; 1：T; 2：WW；3:WWG; 4：RGB; 5：WRGB; 6：WWRGB; 7:WWRGBCMYP*/
    uint64_t Product_Function   :4;     /*0:单色温；1：双色温；2：简单彩色；3：全功能彩色*/
    uint64_t Protocol_Ver       :6;     /*11:代表版本v1.1*/     
    #else
    #endif
}BT_Version_Body_TypeDef;/*size: 8*/

/*----------HSI：0x01------------*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;         /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :37;        /*预留*/
    uint64_t Sat        :7;         /*0-100*/     /*max: 127*/
    uint64_t Hue        :9;         /*0-360*/     /*max: 511*/
    uint64_t Int        :10;        /*0-1000*/  /*max: 1023*/
    #else
    #endif
}BT_HSI_Body_TypeDef;/*size: 8*/

/*----------CCT：0x02-----------*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;         /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :36;        /*预留*/
    uint64_t GM         :7;         /*<0-20>: 0->-1.0,1->-0.9,2->-0.8,   20->+1.0每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;        /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;        /*0-1000*/  /*max: 1023*/
    #else 
    #endif
}BT_CCT_Body_TypeDef;/*size: 8*/

/*----------GEL：0x03-----------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;         /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :28;        /*预留*/
    uint64_t Color      :10;        /*0 - 15*/
    uint64_t Type       :4;         /*0-1023*/
    uint64_t Origin     :1;         /*品牌(0->LEE)(1->Resco)*/
    uint64_t CCT        :10;        /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;        /*0-1000*/
    #else
    #endif
}BT_Gel_Body_TypeDef;/*size: 8*/

/*----------RGBW：0x04-----------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;         /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :3;         /*预留*/
    uint64_t Int        :10;        /*Red   0-1000*/        /*max: 1023*/
    uint64_t CW_Int     :10;        /*Cool white 0-1000*/   /*max: 1023*/
    uint64_t WW_Int     :10;        /*Warm white 0-1000*/   /*max: 1023*/
    uint64_t B_Int      :10;        /*Blue  0-1000*/        /*max: 1023*/
    uint64_t G_Int      :10;        /*Green 0-1000*/        /*max: 1023*/
    uint64_t R_Int      :10;        /*Red   0-1000*/        /*max: 1023*/
    #else
    #endif
}BT_RGBWW_Body_TypeDef;

/*------XY_Coordinate：0x05-----*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode     :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve        :25;    /*预留*/
    uint64_t Coordinate_Y   :14;    /*max: 16384*/
    uint64_t Coordinate_X   :14;    /*max: 16384*/
    uint64_t Int            :10;    /*Warm white 0-1000*/       /*max: 1023*/
    #else
    #endif
}BT_XY_Coordinate_Body_TypeDef;

/*-----LED_Frequency：0x06------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :56;    /*预留*/
    uint64_t Frequency      :8;     /*max: 255*/
    #else
    #endif
}BT_LED_Frequency_Body_TypeDef;

/*------Dimming_Curve：0x08------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :56;    /*预留*/
    uint64_t Curve          :8;     /*<0-3> 0x00:线性,0x01:指数,0x02:对数,0x03:S线*/
    #else
    #endif
}BT_Dimming_Curve_Body_TypeDef;

/*--------Fan_Speed：0x09-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :20;    /*预留*/
    uint64_t Silent_Use     :1;     /*支持静音模式*/
    uint64_t Low_Use        :1;     /*支持低速模式*/
    uint64_t Medium_Use     :1;     /*支持中速模式*/
    uint64_t High_Use       :1;     /*支持高速模式*/
    uint64_t Off_Use        :1;     /*支持关风扇模式*/
    uint64_t Max_Use        :1;     /*支持全速模式*/
    uint64_t Smart_Use      :1;     /*支持自动模式*/
    uint64_t Manual_Use     :1;     /*支持手动模式*/
    uint64_t High_Temp      :4;     /*0x00=正常；0x01=高温*/
    uint64_t Current_Temp   :8;     /*0x00-7F；0x80-FF <0~127；-128~-1> 0x80（-128）=不支持溫度讀取*/
    uint64_t Fixture_Speed  :16;    /*<0-4096> 自定义风扇转速*/
    uint64_t Mode           :8;     /*<0-7> 0x00:Manual 0x01:Smart 0x02:MAX 0x03:OFF 0x04:High 0x05:Medium 0x06:Low 0x07:Silent*/
    #else
    #endif
}BT_Fan_Speed_Body_TypeDef;

/*--------Get_Power：0x0A-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :16;    /*预留*/
    uint64_t Battery_time   :9;     /*电池剩余使用时间，单位分钟*/
    uint64_t Battery_Power  :7;     /*电池剩余电量，单位%*/
    uint64_t Battery_Voltage:16;    /*电池电压，单位为mv*/
    uint64_t Extern_Voltage :16;    /*外部电源电压，单位为mv*/
    #else
    #endif
}BT_Get_Power_Body_TypeDef;

/*------Board_State：0x0B-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :32;    /*预留*/
    uint64_t Error_Info     :16;    /*错误信息，Bit1:state…….  State 0：None error  State 1：Error */
    uint64_t Driver_Temp    :8;     /*,驱动板温度*/
    uint64_t Control_Temp   :8;     /*,控制板板温度*/
    #else
    #endif
}BT_Board_State_Body_TypeDef;

/*--------Sleep_Mode：0x0C-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :56;    /*预留*/
    uint64_t Mode           :8;     /*0x00:睡眠 0x01:唤醒*/
    #else
    #endif
}BT_Sleep_Mode_Body_TypeDef;

/*--------Main_Interface_CMD: 0X0D-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode     :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve        :53;    /*预留*/
    uint64_t Int            :10;    /*主界面亮度*/
    #else
    #endif
}BT_Main_Interface_Body_TypeDef;

/*--------Current_Menu: 0X0E-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :64;    /*预留*/
    #else
    #endif
}BT_Current_Menu_Body_TypeDef;

/*--------Light_Bright: 0X0F-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :54;    /*预留*/
    uint64_t Int            :10;    /*主界面亮度*/
    #else
    #endif
}BT_Light_Bright_Body_TypeDef;

/*-------- 0x10-0x12为Bridge专用协议 --------*/

/*--------Program Effect Flash: 0X13-------*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :17;    /*预留*/
    uint64_t Times          :10;    /*1-1000:1-1000次     大于1000=always*/
    uint64_t Frq            :5;     /*0.1-10Hz 0=0.1Hz …… 9=1Hz …… 19=10Hz*/
    uint64_t GM             :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT            :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int            :10;    /*0-1000*/
    uint64_t Base_Type      :2;     /*0x00:CCT   0x01:HSI*/
    uint64_t Light_Type     :3;     /*0x00:normal  0x01:tube  0x01:pixel mapping*/
    #else
    #endif
}BT_PFX_Flash_CCT_TypeDef;

typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :18;    /*预留*/
    uint64_t Times          :10;    /*1-1000:1-1000次     大于1000=always*/
    uint64_t Frq            :5;     /*0.1-10Hz 0=0.1Hz …… 9=1Hz …… 19=10Hz*/
    uint64_t Sat            :7;     /*0-100*/  /*max: 127*/
    uint64_t Hue            :9;     /*0-360*/     /*max: 511*/
    uint64_t Int            :10;    /*0-1000*/
    uint64_t Base_Type      :2;     /*0x00:CCT   0x01:HSI*/
    uint64_t Light_Type     :3;     /*0x00:normal  0x01:tube  0x01:pixel mapping*/
    #else
    #endif
}BT_PFX_Flash_HSI_TypeDef;

typedef __packed union{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_PFX_Flash_CCT_TypeDef Flash_CCT;
    BT_PFX_Flash_HSI_TypeDef Flash_HSI;
    #else
    #endif
}BT_PFX_Flash_Body_TypeDef;

/*--------Program Effect Chase: 0X14-------*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :2;     /*预留*/
    uint64_t Loop           :1;         
    uint64_t GM_Seq         :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Int_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t CCT_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Time           :10;    /*0.1-100s， 0x09=1s   1023=always*/
    uint64_t GM_Max         :6;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  
    uint64_t GM_Mini        :6;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  
    uint64_t CCT_Max        :7;     /*CCT乘以100，<2800-10000> 28->2800K,29->2900K, 30->3000K,依次类推*/     /*max: 127*/
    uint64_t CCT_Mini       :7;     /*CCT乘以100，<2800-10000> 28->2800K,29->2900K, 30->3000K,依次类推*/     /*max: 127*/
    uint64_t Int_Max        :7;     /*0-100*/
    uint64_t Int_Mini       :7;     /*0-100*/
    uint64_t Base_Type      :2;     /*0x00:CCT   0x01:HSI*/
    uint64_t Light_Type     :3;     /*0x00:normal  0x01:tube  0x01:pixel mapping*/
    #else
    #endif
}BT_PFX_Chase_CCT_TypeDef;

typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Loop           :1;         
    uint64_t Sat_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Int_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Hue_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Time           :10;    /*0.1-100s， 0x09=1s   1023=always*/
    uint64_t Sat_Max        :6;     /*0-50 *2处理*/
    uint64_t Sat_Mini       :6;     /*0-50 *2处理*/
    uint64_t Hue_Max        :9;     /*0-360*/     /*max: 511*/
    uint64_t Hue_Mini       :9;     /*0-360*/     /*max: 511*/
    uint64_t Int_Max        :6;     /*0-50 *2处理*/
    uint64_t Int_Mini       :6;     /*0-50 *2处理*/
    uint64_t Base_Type      :2;     /*0x00:CCT   0x01:HSI*/
    uint64_t Light_Type     :3;     /*0x00:normal  0x01:tube  0x01:pixel mapping*/
    #else
    #endif
}BT_PFX_Chase_HSI_TypeDef;

typedef __packed union{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_PFX_Chase_CCT_TypeDef Chase_CCT;
    BT_PFX_Chase_HSI_TypeDef Chase_HSI;
    #else
    #endif
}BT_PFX_Chase_Body_TypeDef;

/*--------Program Effect Continue: 0X15-------*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :1;     /*预留*/    
    uint64_t FadeOutCurve   :3;     /*0:线性    1:指数    2:对数    3:s型*/ 
    uint64_t FadeOutTime    :8;     /*0.1S为单位    */    
    uint64_t ContinueTime   :10;    /*0.1-100s， 0x09=1s   1023=always*/
    uint64_t FadeInCurve    :3;     /*0:线性    1:指数    2:对数    3:s型*/ 
    uint64_t FadeInTime     :8;     /*0.1S为单位    */ 
    uint64_t GM             :6;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  
    uint64_t CCT            :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int            :10;    /*0-1000*/
    uint64_t Base_Type      :2;     /*0x00:CCT   0x01:HSI*/
    uint64_t Light_Type     :3;     /*0x00:normal  0x01:tube  0x01:pixel mapping*/
    #else
    #endif
}BT_PFX_Continue_CCT_TypeDef;

typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :1;     /*预留*/
    uint64_t FadeOutCurve   :3;     /*0:线性    1:指数    2:对数    3:s型*/ 
    uint64_t FadeOutTime    :8;     /*0.1S为单位    */    
    uint64_t ContinueTime   :10;    /*0.1-100s， 0x09=1s   1023=always*/
    uint64_t FadeInCurve    :3;     /*0:线性    1:指数    2:对数    3:s型*/ 
    uint64_t FadeInTime     :8;     /*0.1S为单位    */     
    uint64_t Sat            :7;     /*0-100*/  /*max: 127*/
    uint64_t Hue            :9;     /*0-360*/     /*max: 511*/
    uint64_t Int            :10;    /*0-1000*/
    uint64_t Base_Type      :2;     /*0x00:CCT   0x01:HSI*/
    uint64_t Light_Type     :3;     /*0x00:normal  0x01:tube  0x01:pixel mapping*/
    #else
    #endif
}BT_PFX_Continue_HSI_TypeDef;

typedef __packed union{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_PFX_Continue_CCT_TypeDef Continue_CCT;
    BT_PFX_Continue_HSI_TypeDef Continue_HSI;
    #else
    #endif
}BT_PFX_Continue_Body_TypeDef;

/*--------CustomEffect_Bank_Ctrl: 0X1A-------*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :47;    /*预留*/
    uint64_t Current_Cache  :4;     /*当前缓存区光效，0-9：bank1-bank10，10-15：NULL(无缓存)*/
    uint64_t Bank_Info      :10;    /*外部flash当前自定义光效类型bank存储信息*/
    uint64_t Effect_Type    :3;     /*自定义光效类型*/
    #else
    #endif
}BT_CFX_Bank_RW_Body_TypeDef;

/*--------CustomEffect_Ctrl: 0X1C-------*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :31;    /*预留*/
    uint64_t Ctrl           :2;     /*0:stop  1:init  2:running 3:pause*/
    uint64_t Loop           :1;     /*0:一次 1:循环*/
    uint64_t Sequence       :2;     /*0:正序 1:反序 2:往复*/
    uint64_t Chaos          :7;     /*0%-100%*/
    uint64_t Speed          :4;     /*0=0.5X, 1=1X 2=2X, 3=4X 4=8X, 5=16X*/
    uint64_t Int            :10;    /*预留*/     
    uint64_t Bank           :4;     /*外部flash当前自定义光效类型bank存储信息*/
    uint64_t Effect_Type    :3;     /*自定义光效类型*/
    #else
    #endif
}BT_CFX_Ctrl_Body_TypeDef;

/*--------APP_Ctrl:0X1D-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve       :56;     /*预留*/
    uint64_t Ctrl_Type     :8;      /*0-蓝牙重置*/
    #else
    #endif
}BT_APP_Ctrl_Body_TypeDef;

/*--------CFX_Preview:0X1E-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
     uint32_t Reserve       :3;     /*预留*/
     uint32_t GM            :7;     /*<0-20>: 0->-1.0,1->-0.9,2->-0.8,   20->+1.0每隔0.1递增1，以此类推*/
     uint32_t CCT           :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
     uint32_t Int           :10;    /*0-1000*/  /*max: 1023*/
     uint32_t Base          :2;     /*0:Base CCT    1:Base HSI*/
    #else
    #endif
}BT_CFX_Preview_BaseCCT;

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
     uint32_t Reserve       :3;     /*预留*/
     uint32_t Sat           :7;     /*0-100*/   /*max: 127*/
     uint32_t Hue           :10;    /*0-360*/   /*max: 1023*/
     uint32_t Int           :10;    /*0-1000*/  /*max: 1023*/
     uint32_t Base          :2;     /*0:Base CCT    1:Base HSI*/
    #else
    #endif
}BT_CFX_Preview_BaseHSI;

typedef __packed union{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    BT_CFX_Preview_BaseCCT BaseCCT;
    BT_CFX_Preview_BaseHSI BaseHSI;
    #else
    #endif
}BT_CFX_Preview_Frame;

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
     BT_CFX_Preview_Frame Frame_2;  //32 Bit
     BT_CFX_Preview_Frame Frame_1;  //32 Bit
     #else
    #endif
}BT_CFX_Preview_Body_TypeDef;

/*--------MFX: 0X1F-------*/
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :4;     /*预留*/
    uint64_t GM_Seq         :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t GM_Max         :7;     /*<0-20>: 0->-1.0,1->-0.9,2->-0.8,   20->+1.0每隔0.1递增1，以此类推*/
    uint64_t GM_Mini        :7;     /*<0-20>: 0->-1.0,1->-0.9,2->-0.8,   20->+1.0每隔0.1递增1，以此类推*/
    uint64_t CCT_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t CCT_Max        :10;    /*0-360*/
    uint64_t CCT_Mini       :10;    /*0-360*/
    uint64_t Int_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Int_Max        :7;     /*0-100*/  
    uint64_t Int_Mini       :7;     /*0-100*/  
    uint64_t Base           :2;     /*0:Base CCT    1:Base HSI*/
    uint64_t Ctrl           :2;     /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;     /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_0_BaseCCT;
    
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :4;      /*预留*/
    uint64_t Sat_Seq        :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Sat_Max        :7;      /*0-100*/     /*max: 127*/
    uint64_t Sat_Mini       :7;      /*0-100*/     /*max: 127*/
    uint64_t Hue_Seq        :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Hue_Max        :10;     /*0-360*/     /*max: 1023*/
    uint64_t Hue_Mini       :10;     /*0-360*/     /*max: 1023*/
    uint64_t Int_Seq        :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Int_Max        :7;      /*0-100*/  
    uint64_t Int_Mini       :7;      /*0-100*/  
    uint64_t Base           :2;      /*0:Base CCT    1:Base HSI*/
    uint64_t Ctrl           :2;      /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;      /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_0_BaseHSI;

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :5;      /*预留*/ 
    uint64_t FreeTime_Seq   :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t FreeTime_Max   :10;     /*0-1000    0.0s~100.0s*/
    uint64_t FreeTime_Mini  :10;     /*0-1000    0.0s~100.0s*/    
    uint64_t CycleTime_Seq  :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t CycleTime_Max  :10;     /*0-1000    0.0s~100.0s*/
    uint64_t CycleTime_Mini :10;     /*0-1000    0.0s~100.0s*/
    uint64_t LoopTimes      :7;      /*1-100*/
    uint64_t LoopMode       :2;      /*0:一次    1:循环   2:随机*/
    uint64_t Effect_Mode    :2;      /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;      /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;      /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_1_Flash;
    
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :3;      /*预留*/ 
    uint64_t FadeIn_Curve   :2;      /*0:线性    1:指数    2:对数    3:S型*/
    uint64_t FadeInTime_Seq :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t FadeInTime_Max :10;     /*0-1000    0.0s~100.0s*/
    uint64_t FadeInTime_Mini:10;     /*0-1000    0.0s~100.0s*/    
    uint64_t CycleTime_Seq  :2;      /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t CycleTime_Max  :10;     /*0-1000    0.0s~100.0s*/
    uint64_t CycleTime_Mini :10;     /*0-1000    0.0s~100.0s*/
    uint64_t LoopTimes      :7;      /*1-100*/
    uint64_t LoopMode       :2;      /*0:一次    1:循环   2:随机*/
    uint64_t Effect_Mode    :2;      /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;      /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;      /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_1_Continue;    

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :5;     /*预留*/ 
    uint64_t UnitTime_Seq   :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t FreeTime_Seq   :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t Overlap_Seq    :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t OLR_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t OLR_Max        :7;     /*重合比例0-100*/
    uint64_t OLR_Mini       :7;     /*重合比例0-100*/   
    uint64_t CycleTime_Seq  :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t CycleTime_Max  :10;    /*0-1000    0.0s~100.0s*/
    uint64_t CycleTime_Mini :10;    /*0-1000    0.0s~100.0s*/
    uint64_t LoopTimes      :7;     /*1-100*/
    uint64_t LoopMode       :2;     /*0:一次    1:循环   2:随机*/
    uint64_t Effect_Mode    :2;     /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;     /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;     /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_1_Paragraph;

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
     uint64_t Reserve       :18;    /*预留*/ 
    uint64_t Frq_Seq        :2;     /*1-129     <1-9:0.1-0.9Hz> <10-129:1-120Hz>*/
    uint64_t Frq_Max        :8;     /*0-1000    0.0s~100.0s*/
    uint64_t Frq_Mini       :8;     /*0-1000    0.0s~100.0s*/    
    uint64_t UnitTime_Seq   :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t UnitTime_Max   :10;    /*0-1000    0.0s~100.0s*/
    uint64_t UnitTime_Mini  :10;    /*0-1000    0.0s~100.0s*/
    uint64_t Effect_Mode    :2;     /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;     /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;     /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_2_Flash;
    
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :26;    /*预留*/ 
    uint64_t Flicker_Frq    :8;     /*1-129     <1-9:0.1-0.9Hz> <10-129:1-120Hz>*/
    uint64_t FadeOut_Curve  :2;     /*0:线性    1:指数    2:对数    3:S型*/   
    uint64_t FadeOutTime_Seq:2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t FadeOutTime_Max:10;    /*0-1000    0.0s~100.0s*/
    uint64_t FadeOutTime_Mini:10;   /*0-1000    0.0s~100.0s*/
    uint64_t Effect_Mode    :2;     /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;     /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;     /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_2_Continue;    

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :2;     /*预留*/ 
    uint64_t OLP_Seq        :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t OLP_Max        :7;     /*重合几率0-100*/
    uint64_t OLP_Mini       :7;     /*重合几率0-100*/
    uint64_t UnitTime_Max   :10;    /*0-1000    0.0s~100.0s*/
    uint64_t UnitTime_Mini  :10;    /*0-1000    0.0s~100.0s*/  
    uint64_t FreeTime_Max   :10;    /*0-1000    0.0s~100.0s*/
    uint64_t FreeTime_Mini  :10;    /*0-1000    0.0s~100.0s*/   
    uint64_t Effect_Mode    :2;     /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;     /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;     /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_2_Paragraph; 
    
typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    uint64_t Reserve        :2;     /*预留*/ 
    uint64_t Flicker_Frq    :8;     /*1-129     <1-9:0.1-0.9Hz> <10-129:1-120Hz>*/
    uint64_t FadeOut_Curve  :2;     /*0:线性    1:指数    2:对数    3:S型*/   
    uint64_t FadeOutTime_Seq:2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t FadeOutTime_Max:10;    /*0-1000    0.0s~100.0s*/
    uint64_t FadeOutTime_Mini:10;   /*0-1000    0.0s~100.0s*/    
    uint64_t FadeIn_Curve   :2;     /*0:线性    1:指数    2:对数    3:S型*/
    uint64_t FadeInTime_Seq :2;     /*0:正向    1:反向    2:往复    3:随机*/
    uint64_t FadeInTime_Max :10;    /*0-1000    0.0s~100.0s*/
    uint64_t FadeInTime_Mini:10;    /*0-1000    0.0s~100.0s*/    
    uint64_t Effect_Mode    :2;     /*0:Flash  1:Continue  2:Paragraph*/
    uint64_t Ctrl           :2;     /*0:Stop  1:Restart  2:Pause  3:Continue*/
    uint64_t Packet_Num     :2;     /*0-3:Packet_0~Packet_3*/
    #else
    #endif
}BT_MFX_Packet_3_Paragraph; 
    
typedef __packed union{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_MFX_Packet_0_BaseCCT     BaseCCT;
    BT_MFX_Packet_0_BaseHSI     BaseHSI;
    #else
    #endif
}BT_MFX_Packet_0;

typedef __packed union{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_MFX_Packet_1_Flash       Flash;
    BT_MFX_Packet_1_Continue    Continue;
    BT_MFX_Packet_1_Paragraph   Paragraph;
    #else
    #endif
}BT_MFX_Packet_1;

typedef __packed union{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_MFX_Packet_2_Flash       Flash;
    BT_MFX_Packet_2_Continue    Continue;
    BT_MFX_Packet_2_Paragraph   Paragraph;
    #else
    #endif
}BT_MFX_Packet_2;

typedef __packed union{
    #if (BYTE_ORDER == LITTLE_ENDIAN)     
    BT_MFX_Packet_3_Paragraph   Paragraph;
    #else
    #endif
}BT_MFX_Packet_3;
    
typedef __packed union{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    BT_MFX_Packet_0 Packet_0;
    BT_MFX_Packet_1 Packet_1;
    BT_MFX_Packet_2 Packet_2;
    BT_MFX_Packet_3 Packet_3;
     #else
    #endif
}BT_MFX_Body_TypeDef;

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Reserve        :2;     /*预留*/
    uint64_t Character_8    :6;     /*字符8     sidus code编码*/
    uint64_t Character_7    :6;     /*字符7     sidus code编码*/
    uint64_t Character_6    :6;     /*字符6     sidus code编码*/
    uint64_t Character_5    :6;     /*字符5     sidus code编码*/
    uint64_t Character_4    :6;     /*字符4     sidus code编码*/
    uint64_t Character_3    :6;     /*字符3     sidus code编码*/
    uint64_t Character_2    :6;     /*字符2     sidus code编码*/
    uint64_t Character_1    :6;     /*字符1     sidus code编码*/
    uint64_t Character_0    :6;     /*字符0     sidus code编码*/  
    uint64_t Code_Type      :2;     /*编码方式 0: sidus code*/  
    uint64_t Bank           :4;     /*Bank位置    0-9:Bank1-10*/
    uint64_t Effect_Type    :2;     /*自定义光效类型 0-Picker         1-Touchbar   2-Music*/
    #else
    #endif
}BT_CFX_Name_Body_TypeDef;



/**************************************************************************************/
/******************************Light Effect********************************************/
/**************************************************************************************/

/************************************光效的类型***************************************/
/*0x00：Club_Lights*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :37;    /*预留*/
    uint64_t Color      :4;     /*<0-3> 0:3; 1:6; 2:9; 3:12*/
    uint64_t Frq        :4;     /*0-15*/   /*max: 15*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Club_Lightse_TypeDef;

/*0x01：Paparazzi*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :24;    /*预留*/
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Frq        :4;     /*0-15*/   /*max: 15*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Paparazzi_TypeDef;

/*0x02：Lightning*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :18;    /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Frq        :4;     /*0-15*/   /*max: 15*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Lightning_TypeDef;

/*0x03：TV*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :31;    /*预留*/
    uint64_t CCT        :10;    /*<0-1000>,CCT变化范围，0表示范围1*/     /*max: 1023*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_TV_TypeDef;

/*0x04：Candle*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :31;    /*预留*/
    uint64_t CCT        :10;    /*<0-1000>,CCT变化范围，0表示范围1*/     /*max: 1023*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Candle_TypeDef;

/*0x05：Fire*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :31;    /*预留*/
    uint64_t CCT        :10;    /*<0-1000>,CCT变化范围，0表示范围1*/     /*max: 1023*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Fire_TypeDef;

/*0x06：Strobe*/
typedef __packed struct{   
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :18;    /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Strobe_CCT_TypeDef;
typedef __packed struct{   
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :19;    /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Hue        :9;     /*0-360*/     /*max: 511*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Strobe_HSI_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :10;    /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Color      :10;    /*0 - 15*/
    uint64_t Type       :4;     /*0-1023*/
    uint64_t Origin     :1;     /*品牌(0->LEE)(1->Resco)*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Strobe_GEL_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :7;     /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Coordinate_y:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Coordinate_x:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Strobe_XY_TypeDef;

typedef __packed union{
    BT_Strobe_CCT_TypeDef   Effect_CCT_Mode;
    BT_Strobe_HSI_TypeDef   Effect_HSI_Mode;
    BT_Strobe_GEL_TypeDef   Effect_Gel_Mode;
    BT_Strobe_XY_TypeDef    Effect_XY_Mode;
}BT_Strobe_MODE_TypeDef;

typedef __packed struct{     
     BT_Strobe_MODE_TypeDef Mode;
}BT_Strobe_TypeDef;

/*0x07：Explosion*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :18;    /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Explosion_CCT_TypeDef;
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :19;    /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Hue        :9;     /*0-360*/     /*max: 511*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Explosion_HSI_TypeDef;

typedef __packed struct{
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :10;    /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Color      :10;    /*0 - 15*/
    uint64_t Type       :4;     /*0-1023*/
    uint64_t Origin     :1;     /*品牌(0->LEE)(1->Resco)*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Explosion_GEL_TypeDef;

typedef __packed struct{   
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :7;     /*预留*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Coordinate_y:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Coordinate_x:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Explosion_XY_TypeDef;

typedef __packed union{
    BT_Explosion_CCT_TypeDef    Effect_CCT_Mode;
    BT_Explosion_HSI_TypeDef    Effect_HSI_Mode;
    BT_Explosion_GEL_TypeDef    Effect_Gel_Mode;
    BT_Explosion_XY_TypeDef     Effect_XY_Mode;
}BT_Explosion_MODE_TypeDef;

typedef __packed struct{    
     BT_Explosion_MODE_TypeDef Mode;
}BT_Explosion_TypeDef;

/*0x08：Fault_Bulb*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :14;    /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_FaultBulb_CCT_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :15;    /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Hue        :9;     /*0-360*/     /*max: 511*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_FaultBulb_HSI_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :6;     /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Color      :10;    /*0 - 15*/
    uint64_t Type       :4;     /*0-1023*/
    uint64_t Origin     :1;     /*品牌(0->LEE)(1->Resco)*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_FaultBulb_GEL_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :3;     /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Coordinate_y:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Coordinate_x:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_FaultBulb_XY_TypeDef;

typedef __packed union{
    BT_FaultBulb_CCT_TypeDef    Effect_CCT_Mode;
    BT_FaultBulb_HSI_TypeDef    Effect_HSI_Mode;
    BT_FaultBulb_GEL_TypeDef    Effect_Gel_Mode;
    BT_FaultBulb_XY_TypeDef     Effect_XY_Mode;
}BT_FaultBulb_MODE_TypeDef;

typedef __packed struct{    
     BT_FaultBulb_MODE_TypeDef Mode;
}BT_FaultBulb_TypeDef;

/*0x09：Pulsing*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :14;    /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Pulsing_CCT_TypeDef;
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :15;    /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Hue        :9;     /*0-360*/     /*max: 511*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Pulsing_HSI_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :6;     /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Color      :10;    /*0 - 15*/
    uint64_t Type       :4;     /*0-1023*/
    uint64_t Origin     :1;     /*品牌(0->LEE)(1->Resco)*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Pulsing_GEL_TypeDef;

typedef __packed struct{   
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :3;     /*预留*/
    uint64_t Speed      :4;     /*<1-11>,11为Random*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Coordinate_y:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Coordinate_x:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Pulsing_XY_TypeDef;
typedef __packed union{
    BT_Pulsing_CCT_TypeDef  Effect_CCT_Mode;
    BT_Pulsing_HSI_TypeDef  Effect_HSI_Mode;
    BT_Pulsing_GEL_TypeDef  Effect_Gel_Mode;
    BT_Pulsing_XY_TypeDef   Effect_XY_Mode;
}BT_Pulsing_MODE_TypeDef;

typedef __packed struct{    
    BT_Pulsing_MODE_TypeDef Mode;
}BT_Pulsing_TypeDef;

/*0x0A：Welding*/
typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :11;    /*预留*/
    uint64_t Min        :7;     /*<0-100>,100表示100%*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t GM         :7;     /*<0-20>: -1.0->0,-0.9->1,-0.8->2,   +1.0->20每隔0.1递增1，以此类推*/  /*max: 31*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Welding_CCT_TypeDef;

typedef __packed struct{   
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :12;    /*预留*/
    uint64_t Min        :7;     /*<0-100>,100表示100%*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Hue        :9;     /*0-360*/     /*max: 511*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Welding_HSI_TypeDef;

typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :3;     /*预留*/
    uint64_t Min        :7;     /*<0-100>,100表示100%*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Color      :10;    /*0 - 15*/
    uint64_t Type       :4;     /*0-1023*/
    uint64_t Origin     :1;     /*品牌(0->LEE)(1->Resco)*/
    uint64_t CCT        :10;    /*CCT乘以10，<2800-10000> 280->2800K,290->2900K, 300->3000K,依次类推*/     /*max: 1023*/
    uint64_t Int        :10;    /*0-1000*//*忽略*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Welding_GEL_TypeDef;

typedef __packed struct{     
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    //uint64_t Reserve    :3;     /*预留*/
    uint64_t Min        :7;     /*<0-100>,100表示100%*/
    uint64_t Trigger    :2;     /*<0-2>,0-无触发/1-单次触发/2-多次触发 */
    uint64_t Coordinate_y:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Coordinate_x:14;   /*0-10000*/     /*max: 16383*/
    uint64_t Int        :10;    /*0-1000*/  /*max: 1023*/
    uint64_t Frq        :4;     /*<0-15>*/
    uint64_t Effect_Mode:4;     /*0-10, 0x00:CCT   0x01:HSI  0x02: Gel*/
    uint64_t Effect_Type:8;     /*0-127*/
    #else
    #endif
}BT_Welding_XY_TypeDef;

typedef __packed union{
    BT_Welding_CCT_TypeDef  Effect_CCT_Mode;
    BT_Welding_HSI_TypeDef  Effect_HSI_Mode;
    BT_Welding_GEL_TypeDef  Effect_Gel_Mode;
    BT_Welding_XY_TypeDef   Effect_XY_Mode;
}BT_Welding_MODE_TypeDef;

typedef __packed struct{
    BT_Welding_MODE_TypeDef Mode;
}BT_Welding_TypeDef;

/*0x0B：Cop_Car*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :37;    /*预留*/
    uint64_t Color      :4;     /*0x00：R；0x01：B；0x02：R+B；0x03：B+W;  0x04：B+W+R*//*max: 1023*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Cop_Car_TypeDef;

/*0x0C：Color_Chase*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :34;    /*预留*/
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Color_Chase_TypeDef;

/*0x0D：Party_Lights*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :34;    /*预留*/
    uint64_t Sat        :7;     /*0-100*/     /*max: 127*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Party_Lights_TypeDef;

/*0x0E：Fireworks*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :33;    /*预留*/
    uint64_t Type       :8;     /*0-100*/     /*max: 127*/
    uint64_t Frq        :4;     /*0-10*/
    uint64_t Int        :10;    /*0-1000*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Fireworks_TypeDef;

/*0x0F：Effect_Off*/
typedef __packed struct{    
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :55;    /*预留*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}BT_Effect_Off_TypeDef;

/*0x10：I_AM_HERE*/
typedef __packed struct{  
    #if (BYTE_ORDER == LITTLE_ENDIAN)
    uint64_t Sleep_Mode :1;     /*0x00:睡眠   0x01:唤醒*/
    uint64_t Reserve    :53;    /*预留*/
    uint64_t Ctrl       :2;     /*控制状态 0x00：启动    0x01：停止并退出*/
    uint64_t Effect_Type:8;     /*0-1000*/
    #else
    #endif
}I_Am_Here_TypeDef;

/*--------EFFECT_CMD：0x07-------*/
typedef __packed union{   
    BT_Club_Lightse_TypeDef Club_Lights_Arg;
    BT_Paparazzi_TypeDef    Paparazzi_Arg;
    BT_Lightning_TypeDef    Lightning_Arg;
    BT_TV_TypeDef           TV_Arg;
    BT_Candle_TypeDef       Candle_Arg;
    BT_Fire_TypeDef         Fire_Arg;
    BT_Strobe_TypeDef       Strobe_Arg;
    BT_Explosion_TypeDef    Explosion_Arg;
    BT_FaultBulb_TypeDef    Fault_Bulb_Arg;
    BT_Pulsing_TypeDef      Pulsing_Arg;
    BT_Welding_TypeDef      Welding_Arg;
    BT_Cop_Car_TypeDef      Cop_Car_Arg;
    BT_Color_Chase_TypeDef  Color_Chase_Arg;
    BT_Party_Lights_TypeDef Party_Lights_Arg;
    BT_Fireworks_TypeDef    Fireworks_Arg;
