/****************************************************************************************
**  Filename :  111.h
**  Abstract :  。
**  By       :  何建国
**  Date     :  
**  Changelog:1.First Create
*****************************************************************************************/
#ifndef _RS485_PROTO_SLAVE_ANALYSIS_H
#define _RS485_PROTO_SLAVE_ANALYSIS_H
/*****************************************************************************************
									Includes
*****************************************************************************************/
#include "rs485_protocol.h"
#include "stdlib.h"
/*****************************************************************************************
								Macro definitions
*****************************************************************************************/

/*****************************************************************************************
								Typedef definitions
*****************************************************************************************/
/*从机应用*/
typedef __packed struct{
    rs485_cmd_enum          command_type;           /*需要等待应答的命令类型*/
    uint16_t                delay_time;             /*等待应答的最大时间*/
    rs485_ack_enum          ack_type;               /*应答类型*/
    uint16_t                ack_slot;               /*应答字段对应的位置*/
    rs485_ack_enum(*wait_ack)(void);                /*等待应答函数指针*/
}Rs485_Special_Ack_TypeDef;
/*****************************************************************************************
							Global variables and functions
*****************************************************************************************/
extern uint8_t     g_Rs485_Send_Buf[RS485_MESSAGE_MAX_SIZE];
/*从机应用*/
extern Rs485_Special_Ack_TypeDef g_rs485_ack_wait;
//----------------------------------------------------------------------------------------
extern void (*g_pRs485ProtoTxCallback)(uint16_t Length, uint8_t *pBuff);
extern void Rs485_Slave_Recv_Port(uint8_t* p_data);
extern void RS485_Ack_Ctr(void);
#endif
/***********************************END OF FILE*******************************************/
